JiGoRo1969/nuttx_rx66t/nuttx_731_rx66t/nuttx/arch/renesas/src/rx66t/rx66t_serial.c
/****************************************************************************
 * arch/renesas/src/rx66t/rx66t_serial.c
 *
 *   Copyright (C) 2008-2019 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <semaphore.h>
#include <string.h>
#include <errno.h>
#include <debug.h>
#include <stdio.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/serial/serial.h>
#include "rx66t_macrodriver.h"
#include "rx66t/iodefine.h"
#include "chip.h"
#include "up_arch.h"
#include "up_internal.h"
#include "rx66t_definitions.h"
#include "rx66t_sci.h"
#include "rx66t/irq.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Some sanity checks *******************************************************/

#ifdef USE_SERIALDRIVER

/* Which SCI with be tty0/console and which tty1? */

#if 1

#ifdef	CONFIG_RX66T_SCI1
#  define	TTYS1_DEV	g_sci1port		/* SCI1 is tty1 */
#else
#  undef	TTYS1_DEV					/* No tty1 */
#endif
#ifdef	CONFIG_RX66T_SCI5
#  define	TTYS5_DEV	g_sci5port		/* SCI5 is tty5 */
#else
#  undef	TTYS5_DEV					/* No tty5 */
#endif
#ifdef	CONFIG_RX66T_SCI6
#  define	TTYS6_DEV	g_sci6port		/* SCI6 is tty6 */
#else
#  undef	TTYS6_DEV					/* No tty6 */
#endif
#ifdef	CONFIG_RX66T_SCI8
#  define	TTYS8_DEV	g_sci8port		/* SCI8 is tty8 */
#else
#  undef	TTYS8_DEV					/* No tty8 */
#endif
#ifdef	CONFIG_RX66T_SCI9
#  define	TTYS9_DEV	g_sci9port		/* SCI9 is tty9 */
#else
#  undef	TTYS9_DEV					/* No tty9 */
#endif
#ifdef	CONFIG_RX66T_SCI11
#  define	TTYS11_DEV	g_sci11port		/* SCI11 is tty11*/
#else
#  undef	TTYS11_DEV					/* No tty11 */
#endif
#ifdef	CONFIG_RX66T_SCI12
#  define	TTYS12_DEV	g_sci12port		/* SCI12 is tty12 */
#else
#  undef	TTYS12_DEV					/* No tty12 */
#endif

#if defined(CONFIG_SCI1_SERIAL_CONSOLE) && defined(CONFIG_RX66T_SCI1)
#  define		HAVE_CONSOLE
#  define		CONSOLE_DEV		g_sci1port		/* SCI1 is console */
#  define		TTYS0_DEV		CONSOLE_DEV
#elif defined(CONFIG_SCI5_SERIAL_CONSOLE) && defined(CONFIG_RX66T_SCI5)
#  define		HAVE_CONSOLE
#  define		CONSOLE_DEV		g_sci5port		/* SCI5 is console */
#  define		TTYS0_DEV		CONSOLE_DEV
#elif defined(CONFIG_SCI6_SERIAL_CONSOLE) && defined(CONFIG_RX66T_SCI6)
#  define		HAVE_CONSOLE
#  define		CONSOLE_DEV		g_sci6port		/* SCI6 is console */
#  define		TTYS0_DEV		CONSOLE_DEV
#elif defined(CONFIG_SCI8_SERIAL_CONSOLE) && defined(CONFIG_RX66T_SCI8)
#  define		HAVE_CONSOLE
#  define		CONSOLE_DEV		g_sci8port		/* SCI8 is console */
#  define		TTYS0_DEV		CONSOLE_DEV
#elif defined(CONFIG_SCI11_SERIAL_CONSOLE) && defined(CONFIG_RX66T_SCI11)
#  define		HAVE_CONSOLE
#  define		CONSOLE_DEV		g_sci11port		/* SCI11 is console */
#  define		TTYS0_DEV		CONSOLE_DEV
#elif defined(CONFIG_SCI12_SERIAL_CONSOLE) && defined(CONFIG_RX66T_SCI12)
#  define		HAVE_CONSOLE
#  define		CONSOLE_DEV		g_sci12port		/* SCI12 is console */
#  define		TTYS0_DEV		CONSOLE_DEV
#else	/* No console */
#  undef		HAVE_CONSOLE
#  undef		CONSOLE_DEV
#endif

#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct up_dev_s
{
				uint32_t	scibase;	/* Base address of SCI registers */
				uint32_t	baud;		/* Configured baud */
	volatile	uint8_t		scr;		/* Saved SCR value */
	volatile	uint8_t		ssr;		/* Saved SR value (only used during interrupt processing) */
				uint8_t		xmitirq;	/* Base IRQ associated with xmit IRQ */
				uint8_t		recvirq;	/* Base IRQ associated with receive IRQ */
				uint8_t		eriirq;
				uint8_t		teiirq;
				uint32_t	grpibase;
				uint32_t	erimask;
				uint32_t	teimask;
				uint8_t		parity;		/* 0=none, 1=odd, 2=even */
				uint8_t		bits;		/* Number of bits (7 or 8) */
				bool		stopbits2;	/* true: Configure with 2 stop bits instead of 1 */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/
static int  up_setup(struct uart_dev_s *dev);
static void up_shutdown(struct uart_dev_s *dev);
static int  up_attach(struct uart_dev_s *dev);
static void up_detach(struct uart_dev_s *dev);
static int  up_interrupt(int irq, void *context, FAR void *arg);
static int  up_eriinterrupt(int irq, void *context, FAR void *arg);
static int  up_teiinterrupt(int irq, void *context, FAR void *arg);
static int  up_receive(struct uart_dev_s *dev, uint32_t *status);
static void up_rxint(struct uart_dev_s *dev, bool enable);
static bool up_rxavailable(struct uart_dev_s *dev);
static void up_send(struct uart_dev_s *dev, int ch);
static void up_txint(struct uart_dev_s *dev, bool enable);
static bool up_txready(struct uart_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I/O buffers */

struct uart_ops_s g_sci_ops =
{
	.setup			= up_setup,
	.shutdown		= up_shutdown,
	.attach			= up_attach,
	.detach			= up_detach,
	.receive		= up_receive,
	.rxint			= up_rxint,
	.rxavailable	= up_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
	.rxflowcontrol	= NULL,
#endif
	.send			= up_send,
	.txint			= up_txint,
	.txready		= up_txready,
	.txempty		= up_txready,
};

#ifdef CONFIG_RX66T_SCI1
static char		g_sci1rxbuffer[CONFIG_SCI1_RXBUFSIZE];
static char		g_sci1txbuffer[CONFIG_SCI1_TXBUFSIZE];

