JiGoRo1969/nuttx_rx66t/nuttx_731_rx66t/nuttx/arch/renesas/src/rx66t/rx66t_serial.c
/****************************************************************************
 * Name: up_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes
 *   that up_earlyconsoleinit was called previously.
 *
 ****************************************************************************/
void    up_serialinit(void)
{
	/* Register all SCIs */
#ifdef CONFIG_RX66T_SCI1
	R_SCI1_Create();
	up_setup(&CONSOLE_DEV);
	R_SCI1_Start();
	SCI1.SCR.BIT.TE = 1U;
#if	defined(TTYS1_DEV)
	(void)uart_register("/dev/ttyS1", &TTYS1_DEV);
#endif
#endif
#ifdef CONFIG_RX66T_SCI5
	R_SCI5_Create();
	up_setup(&g_sci5port);
	R_SCI5_Start();
	SCI5.SCR.BIT.TE = 1U;
#if	defined(TTYS5_DEV)
	(void)uart_register("/dev/ttyS5", &TTYS5_DEV);
#endif
#endif
#ifdef CONFIG_RX66T_SCI6
	R_SCI6_Create();
	up_setup(&g_sci6port);
	R_SCI6_Start();
	SCI6.SCR.BIT.TE = 1U;
#if	defined(TTYS6_DEV)
	(void)uart_register("/dev/ttyS6", &TTYS6_DEV);
#endif
#endif
#ifdef CONFIG_RX66T_SCI8
	R_SCI8_Create();
	up_setup(&g_sci8port);
	R_SCI8_Start();
	SCI8.SCR.BIT.TE = 1U;
#if	defined(TTYS8_DEV)
	(void)uart_register("/dev/ttyS8", &TTYS8_DEV);
#endif
#endif
#ifdef CONFIG_RX66T_SCI9
	R_SCI9_Create();
	up_setup(&g_sci9port);
	R_SCI9_Start();
	SCI9.SCR.BIT.TE = 1U;
#if	defined(TTYS9_DEV)
	(void)uart_register("/dev/ttyS9", &TTYS9_DEV);
#endif
#endif
#ifdef CONFIG_RX66T_SCI11
	R_SCI11_Create();
	up_setup(&g_sci11port);
	R_SCI11_Start();
	SCI11.SCR.BIT.TE = 1U;
  #if defined(TTYS11_DEV)
	(void)uart_register("/dev/ttyS11", &TTYS11_DEV);
  #endif
#endif
#ifdef CONFIG_RX66T_SCI12
	R_SCI12_Create();
	up_setup(&g_sci12port);
	R_SCI12_Start();
	SCI12.SCR.BIT.TE = 1U;
#if	defined(TTYS12_DEV)
	(void)uart_register("/dev/ttyS12", &TTYS12_DEV);
#endif
#endif
	/* Register the console */
#ifdef HAVE_CONSOLE
	(void)uart_register("/dev/console", &CONSOLE_DEV);
#endif
}

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug  writes
 *
 ****************************************************************************/
int		up_putc(int ch)
{
#ifdef HAVE_CONSOLE
	struct up_dev_s *priv;
	uint8_t  scr;

	priv = (struct up_dev_s*)CONSOLE_DEV.priv;
	up_disablesciint(priv, &scr);
	/* Check for LF */
	if(ch == '\n') {
		/* Add CR */
		up_waittxready(priv);
		up_serialout(priv, RX_SCI_TDR_OFFSET, '\r');
	}
	up_waittxready(priv);
	up_serialout(priv, RX_SCI_TDR_OFFSET, (uint8_t)ch);
	up_waittxready(priv);
	up_restoresciint(priv, scr);
#endif
	return ch;
}
#else /* USE_SERIALDRIVER */
/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/
int		up_putc(int ch)
{
#ifdef HAVE_CONSOLE
	/* Check for LF */
	if(ch == '\n') {
		/* Add CR */
		up_lowputc('\r');
	}
	up_lowputc(ch);
#endif
	return ch;
}

#endif /* USE_SERIALDRIVER */
